app/controllers/articles_controller.rb

                def index
                    if @current_user
                        @articles = Article.all
---
SELECT "articles".* FROM "articles"

            def destroy
                @article = Article.find(params[:id])
                @article.comments.destroy
                @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]

            def update
                @article = Article.find(params[:id])
                if @current_user && @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Death Be Proud"], ["updated_at", "2021-02-14 18:59:23.905640"], ["id", 1]]