app/controllers/registrations_controller.rb

            def create
                user = User.create!(
                    username: params["user"]["username"],
                    password: params["user"]["password"],
                    password_confirmation: params["user"]["password_confirmation"]
                )
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-02-13 21:52:45.002206"], ["updated_at", "2021-02-13 21:52:45.002206"]]